# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [1]:
import numpy as np
import pandas as pd

## CSV

### CSV Input

In [2]:
pwd

'E:\\My Drive\\Cursos\\Python\\Py_DS_ML\\03-Python-for-Data-Analysis-Pandas'

In [36]:
df = pd.read_csv('example') # Ler
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [37]:
df.to_csv('example',index=False) # Salvar. Index=False n√£o salva o index na tabela

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [38]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

TypeError: read_excel() got an unexpected keyword argument `sheetname`

In [39]:
pd.read_excel('Excel_Sample.xlsx', sheet_name=0)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [40]:
pd.to_excel('Excel_sample2.xlsx',sheet_name=0)

AttributeError: module 'pandas' has no attribute 'to_excel'

### Excel Output

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [41]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [42]:
type(df)

list

In [43]:
df

[                                             Bank Name        City  ST   CERT  \
 0                                 The Enloe State Bank      Cooper  TX  10716
 1                  Washington Federal Bank for Savings     Chicago  IL  30570
 2      The Farmers and Merchants State Bank of Argonia     Argonia  KS  17719
 3                                  Fayette County Bank  Saint Elmo  IL   1802
 4    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...   Milwaukee  WI  30003
 ..                                                 ...         ...  ..    ...
 551                                 Superior Bank, FSB    Hinsdale  IL  32646
 552                                Malta National Bank       Malta  OH   6629
 553                    First Alliance Bank & Trust Co.  Manchester  NH  34264
 554                  National State Bank of Metropolis  Metropolis  IL   3815
 555                                   Bank of Honolulu    Honolulu  HI  21029

                    Acquiring Institution       Closing Date       Updated Date
 0                     Legend Bank, N. A.       May 31, 2019    August 22, 2019
 1                     Royal Savings Bank  December 15, 2017      July 24, 2019
 2                            Conway Bank   October 13, 2017    August 12, 2019
 3              United Fidelity Bank, fsb       May 26, 2017   January 29, 2019
 4    First-Citizens Bank & Trust Company        May 5, 2017     March 22, 2018
 ..                                   ...                ...                ...
 551                Superior Federal, FSB      July 27, 2001    August 19, 2014
 552                    North Valley Bank        May 3, 2001  November 18, 2002
 553  Southern New Hampshire Bank & Trust   February 2, 2001  February 18, 2003
 554              Banterra Bank of Marion  December 14, 2000     March 17, 2005
 555                   Bank of the Orient   October 13, 2000     March 17, 2005

 [556 rows x 7 columns]]

In [67]:
df = df[0]

____

_____
_____
# SQL (Optional)

* Note: If you are completely unfamiliar with SQL you can check out my other course: "Complete SQL Bootcamp" to learn SQL.

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Python‚Äôs standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [64]:
from sqlalchemy import create_engine

In [68]:
engine = create_engine('sqlite:///:memory:')

In [69]:
pd.io.sql._is_sqlalchemy_connectable(engine)

True

In [70]:
df.to_sql('data', engine)

In [71]:
sql_df = pd.read_sql('data',con=engine)

In [72]:
sql_df

,index,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
1,1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
...,...,...,...,...,...,...,...,...
551,551,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
552,552,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
553,553,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
554,554,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
555,555,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"